
* Projects

** TODO StockBook

*** TODO 目录整理 [3/3]
    - [X] 学生初步整理，一稿至三稿
      - 吴总评价：有进步，但不够
    - [X] 学生每人各整理二十章市面上流行的股票书籍目录名
      - 个人评价：只是简单复制粘贴，没有细看，工作不够认真，已批评学生
    - [X] 对学生整理的目录进行格式统一与评价
      - Deadline 是周三，时间紧迫，挑取二十二本书做了大体评价
      - 吴总尚未发表意见
    - [ ] 新版目录，To be continued

*** TODO 内容填充 [1/2]
    - [X] 初稿一至三章完成
      - 内容偏简陋
      - 吴总意见，逻辑不是很清楚，重新修改
    - [ ] 二稿重新规划章节后，每人在自己负责部分完成了前一到两章
      - 吴总意见是全书逻辑上分为四个部分，包括
      - 内容欠丰富，至少每人需扩充五倍内容左右
    - [ ] *新目录未定型，内容往下填充怎么个流程，需要思考*

      
*** TODO 阅读经典股票书籍
    
**** STARTED 操盘学                                                  :伍朝辉:
     :LOGBOOK:
     CLOCK: [2016-12-04 周日 23:39]--[2016-12-05 周一 00:04] =>  0:25
     :END:

** TODO ChaosBook
   
*** TODO 第一阶段 王雄负责的书籍内容
    - 已完成初稿撰写，但对其中第六章，Simple chaos with any number and any type equilibrium，需要对 any type 这个
      点，进行扩充
    - 表格与图片的细节调整

*** TODO 第二阶段，全书整合
    - 已完成最初步整合，但是对于大部分内容没有细改
    - *参考文献的处理*：
      对每一章的参考文献，统一为一个 bib 文件，然后对应每个文章的 cite，统一命名
    - *图片的处理*：
      对每个章节的图片名，最好统一前缀，避免重名
    - *章节名的互相引用，需要处理*

** TODO Python 常用库使用学习

*** TODO Numpy 与 Scipy 学习

*** TODO Pandas 学习

** TODO Python 量化平台学习
   
*** DONE 平台选择
    CLOSED: [2016-12-04 日 19:47]
    - State "DONE"       from "STARTED"    [2016-12-04 日 19:47]
    :LOGBOOK:
    CLOCK: [2016-12-04 日 19:40]--[2016-12-04 日 19:47] =>  0:07
    :END:
    [[https://www.zhihu.com/question/35097533]]
    策略最重要的考量是安全性，可以参考其他平台的 API 文档与社区，以掘金为主要开发平台。

*** STARTED 掘金平台 API 文档阅读
    :LOGBOOK:
    CLOCK: [2016-12-04 日 19:57]--[2016-12-04 日 20:17] =>  0:20
    :END:

*** STARTED tushare 学习
    :LOGBOOK:
    CLOCK: [2016-12-04 日 20:21]--[2016-12-04 日 20:46] =>  0:25
    :END:
   
**** DONE 行情获取
     CLOSED: [2016-12-04 日 20:58]
     - State "DONE"       from              [2016-12-04 日 20:58]

**** STARTED 关于作图 
     :LOGBOOK:
     CLOCK: [2016-12-04 周日 23:18]--[2016-12-04 周日 23:30] =>  0:12
     :END:
     1. 看到 tushare 公众号有推送用 JS 作图，嗯，我先试试看 --> 算了，实验失败，requireJS 不会使用，出错
** TODO TradeBlazer 学习

* Miscellaneous

** DONE 邀请云云来深大玩
   CLOSED: [2016-12-02 五 17:38] SCHEDULED: <2016-12-01 四 17:00>

   - State "DONE"       from "STARTED"    [2016-12-02 五 17:38]
     
** DONE 给马美莲邮件，关于王雄老师混沌书
   CLOSED: [2016-12-02 五 19:49] SCHEDULED: <2016-12-02 五 19:00>
   - State "DONE"       from "TODO"       [2016-12-02 五 19:49]
* Finance

** 2016/12

*** Day1
    + 交通: -2.00 (M425 文汇中学 --> 深大北门)
    + 交通: -1.00 (校园小巴 深大北门 --> 师范学院)
    + 午饭：-23.00 (日式豚骨拉面)
    + 饮料: -31.00 (星巴克大杯拿铁)
    + 交通: -0.30 (Funbike 办公楼 --> 杜鹃山; 桂庙 --> 星巴克(软件产业基地); 星巴克(软件产业基地) --> 混沌量化实验室)
    + 晚饭：-55.00 (烤鱼)
    + 水果：-33.60 (桂庙水果町)
    + 夜宵：-18.00 (榴莲斑戟)
    + 快车：-31.00 (深大小西门 --> 永联学校)
    + 红包：+25.00 (云云)
    + 支出：-194.9
    + 收入：25.00
    + 总支出：-169.9

*** Day2
    
    + 交通：-2.00 (M209 雅豪轩 --> 桂庙村口)
    + 午饭：-22.00 (真功夫 香菇鸡腿肉+蒸蛋)
    + 饮料：-3.00 (星巴克馥瑞白)
    + 水果：-26.5 (桂庙水果町)
    + 交通：-0.50 (Bluegogo 桂庙 --> 混沌量化实验室)
    + 晚饭：-23.00 (豚骨拉面加个蛋)
    + 交通：-2.00 (M209 桂庙 --> 文汇中学)
    + 夜宵：-56.00 (血糯米奶茶，珍珠奶茶，鸡翅，臭豆腐)
    + 支出：135.00
    + 总支出：135.00

*** Day3
    + 交通：-2.00 (M209 雅豪轩 --> 深大南区运动场)
    + 交通：-1.00 (魔拜单车 雅安小学 <--> 微家公寓)
    + 午饭：-23.00 (豚骨拉面加个蛋)
    + 饮食：-26.60 (桂庙水果町)
    + 饮食：-43.00 (麦当劳 麦辣鸡翅加吉士汉堡套餐)
    + 交通：-2.50 (M425 深大北门 --> 文汇中学)
    + 交通：-2.00 (摩拜单车 微家公寓 <--> 流塘)
    + 娱乐：-198.00
    + 理发：-80.00
    + 支出：-378.10
    + 总支出：-378.10

*** Day4
    + 交通： -1.00 (魔拜单车 弘雅小学 <--> 微家公寓)
    + 午饭： -42.00 (合家餐厅 牛肉面加鸡翅)
    + 交通： -2.00 (M209 雅豪轩 --> 深大南区运动场)
    + 水果： -26.00 (桂庙水果町)
    + 饮料： -12.00 (宝矿力和 NFC 橙汁)
    + 交通： -2.00 (M209 深大南区运动场 --> 雅豪轩)
    + 咖啡： -28.00 (星巴克馥瑞白加小熊蛋糕)
    + 夜宵： -55.00 (厕所串串)
    + 支出： -168.00
    + 总支出： -168.00

* Daily Task

** DONE 王雄混沌书籍前两章，精修
   CLOSED: [2016-12-03 六 14:31] SCHEDULED: <2016-12-03 六>
   - State "DONE"       from "STARTED"    [2016-12-03 六 14:31]
   :LOGBOOK:
   CLOCK: [2016-12-03 六 13:10]--[2016-12-03 六 13:35] =>  0:25
   :END:

** DONE 王雄混沌书籍第三、四章，精修
   CLOSED: [2016-12-04 日 19:28] SCHEDULED: <2016-12-04 日>
   - State "DONE"       from "STARTED"    [2016-12-04 日 19:28]
   :LOGBOOK:
   CLOCK: [2016-12-04 日 19:23]--[2016-12-04 日 19:28] =>  0:05
   :END:
** WAITING 掘金量化平台，跑起一个简单策略
   - State "WAITING"    from "TODO"       [2016-12-04 日 20:17] \\
     目前平台是 Linux，非交易时段，似乎直接跑 example 代码都不行，也可能直接上手有点困难，
     也许，做研究的话，用 tushare 会是比较不错的选择，我来试试
** DONE Tushare 模块，获取行情，文档整理
   CLOSED: [2016-12-04 日 20:58]
   - State "DONE"       from              [2016-12-04 日 20:58]
